app/controllers/contractors_controller.rb

SELECT * FROM "contractors"
---
  def index
    @contractors = Contractor.all

SELECT * FROM "contractors" WHERE ("contractors"."id" = 1)
---
  def show
    @contractor = Contractor.find(params[:id])