app/controllers/goods_controller.rb

SELECT * FROM "goods"
---
  def index
    @goods = Goods.all

SELECT * FROM "goods" WHERE ("goods"."id" = 1)
---
  def show
    @goods = Goods.find(params[:id])