app/controllers/prices_controller.rb

SELECT * FROM "prices" WHERE ("prices"."id" = 1)
---
  def show
    @price = Price.find(params[:id])

INSERT INTO "prices" ("created_at", "updated_at", "price_id") VALUES('2010-07-21 09:22:04', '2010-07-21 09:22:04', 'some_id')
---
  def create
    @price = Price.new(params[:price])

    respond_to do |format|
      if @price.save